tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nuvoton/nuc121_125/Device/Nuvoton/NUC121/Include/bpwm_reg.h
#define BPWM_CAPCTL_CAPEN2_Pos            (2)                                              /*!< BPWM_T::CAPCTL: CAPEN2 Position        */
#define BPWM_CAPCTL_CAPEN2_Msk            (0x1ul << BPWM_CAPCTL_CAPEN2_Pos)                /*!< BPWM_T::CAPCTL: CAPEN2 Mask            */

#define BPWM_CAPCTL_CAPEN3_Pos            (3)                                              /*!< BPWM_T::CAPCTL: CAPEN3 Position        */
#define BPWM_CAPCTL_CAPEN3_Msk            (0x1ul << BPWM_CAPCTL_CAPEN3_Pos)                /*!< BPWM_T::CAPCTL: CAPEN3 Mask            */

#define BPWM_CAPCTL_CAPEN4_Pos            (4)                                              /*!< BPWM_T::CAPCTL: CAPEN4 Position        */
#define BPWM_CAPCTL_CAPEN4_Msk            (0x1ul << BPWM_CAPCTL_CAPEN4_Pos)                /*!< BPWM_T::CAPCTL: CAPEN4 Mask            */

#define BPWM_CAPCTL_CAPEN5_Pos            (5)                                              /*!< BPWM_T::CAPCTL: CAPEN5 Position        */
#define BPWM_CAPCTL_CAPEN5_Msk            (0x1ul << BPWM_CAPCTL_CAPEN5_Pos)                /*!< BPWM_T::CAPCTL: CAPEN5 Mask            */

#define BPWM_CAPCTL_CAPINV0_Pos           (8)                                              /*!< BPWM_T::CAPCTL: CAPINV0 Position       */
#define BPWM_CAPCTL_CAPINV0_Msk           (0x1ul << BPWM_CAPCTL_CAPINV0_Pos)               /*!< BPWM_T::CAPCTL: CAPINV0 Mask           */

#define BPWM_CAPCTL_CAPINV1_Pos           (9)                                              /*!< BPWM_T::CAPCTL: CAPINV1 Position       */
#define BPWM_CAPCTL_CAPINV1_Msk           (0x1ul << BPWM_CAPCTL_CAPINV1_Pos)               /*!< BPWM_T::CAPCTL: CAPINV1 Mask           */

#define BPWM_CAPCTL_CAPINV2_Pos           (10)                                             /*!< BPWM_T::CAPCTL: CAPINV2 Position       */
#define BPWM_CAPCTL_CAPINV2_Msk           (0x1ul << BPWM_CAPCTL_CAPINV2_Pos)               /*!< BPWM_T::CAPCTL: CAPINV2 Mask           */

#define BPWM_CAPCTL_CAPINV3_Pos           (11)                                             /*!< BPWM_T::CAPCTL: CAPINV3 Position       */
#define BPWM_CAPCTL_CAPINV3_Msk           (0x1ul << BPWM_CAPCTL_CAPINV3_Pos)               /*!< BPWM_T::CAPCTL: CAPINV3 Mask           */

#define BPWM_CAPCTL_CAPINV4_Pos           (12)                                             /*!< BPWM_T::CAPCTL: CAPINV4 Position       */
#define BPWM_CAPCTL_CAPINV4_Msk           (0x1ul << BPWM_CAPCTL_CAPINV4_Pos)               /*!< BPWM_T::CAPCTL: CAPINV4 Mask           */

#define BPWM_CAPCTL_CAPINV5_Pos           (13)                                             /*!< BPWM_T::CAPCTL: CAPINV5 Position       */
#define BPWM_CAPCTL_CAPINV5_Msk           (0x1ul << BPWM_CAPCTL_CAPINV5_Pos)               /*!< BPWM_T::CAPCTL: CAPINV5 Mask           */

#define BPWM_CAPCTL_RCRLDEN0_Pos          (16)                                             /*!< BPWM_T::CAPCTL: RCRLDEN0 Position      */
#define BPWM_CAPCTL_RCRLDEN0_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN0_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN0 Mask          */

#define BPWM_CAPCTL_RCRLDEN1_Pos          (17)                                             /*!< BPWM_T::CAPCTL: RCRLDEN1 Position      */
#define BPWM_CAPCTL_RCRLDEN1_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN1_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN1 Mask          */

#define BPWM_CAPCTL_RCRLDEN2_Pos          (18)                                             /*!< BPWM_T::CAPCTL: RCRLDEN2 Position      */
#define BPWM_CAPCTL_RCRLDEN2_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN2_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN2 Mask          */

#define BPWM_CAPCTL_RCRLDEN3_Pos          (19)                                             /*!< BPWM_T::CAPCTL: RCRLDEN3 Position      */
#define BPWM_CAPCTL_RCRLDEN3_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN3_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN3 Mask          */

#define BPWM_CAPCTL_RCRLDEN4_Pos          (20)                                             /*!< BPWM_T::CAPCTL: RCRLDEN4 Position      */
#define BPWM_CAPCTL_RCRLDEN4_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN4_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN4 Mask          */

#define BPWM_CAPCTL_RCRLDEN5_Pos          (21)                                             /*!< BPWM_T::CAPCTL: RCRLDEN5 Position      */
#define BPWM_CAPCTL_RCRLDEN5_Msk          (0x1ul << BPWM_CAPCTL_RCRLDEN5_Pos)              /*!< BPWM_T::CAPCTL: RCRLDEN5 Mask          */

#define BPWM_CAPCTL_FCRLDEN0_Pos          (24)                                             /*!< BPWM_T::CAPCTL: FCRLDEN0 Position      */
#define BPWM_CAPCTL_FCRLDEN0_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN0_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN0 Mask          */

#define BPWM_CAPCTL_FCRLDEN1_Pos          (25)                                             /*!< BPWM_T::CAPCTL: FCRLDEN1 Position      */
#define BPWM_CAPCTL_FCRLDEN1_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN1_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN1 Mask          */

#define BPWM_CAPCTL_FCRLDEN2_Pos          (26)                                             /*!< BPWM_T::CAPCTL: FCRLDEN2 Position      */
#define BPWM_CAPCTL_FCRLDEN2_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN2_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN2 Mask          */

#define BPWM_CAPCTL_FCRLDEN3_Pos          (27)                                             /*!< BPWM_T::CAPCTL: FCRLDEN3 Position      */
#define BPWM_CAPCTL_FCRLDEN3_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN3_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN3 Mask          */

#define BPWM_CAPCTL_FCRLDEN4_Pos          (28)                                             /*!< BPWM_T::CAPCTL: FCRLDEN4 Position      */
#define BPWM_CAPCTL_FCRLDEN4_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN4_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN4 Mask          */

#define BPWM_CAPCTL_FCRLDEN5_Pos          (29)                                             /*!< BPWM_T::CAPCTL: FCRLDEN5 Position      */
#define BPWM_CAPCTL_FCRLDEN5_Msk          (0x1ul << BPWM_CAPCTL_FCRLDEN5_Pos)              /*!< BPWM_T::CAPCTL: FCRLDEN5 Mask          */

#define BPWM_CAPSTS_CRLIFOV0_Pos          (0)                                              /*!< BPWM_T::CAPSTS: CRLIFOV0 Position      */
#define BPWM_CAPSTS_CRLIFOV0_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV0_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV0 Mask          */

