tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nuvoton/nuc121_125/Device/Nuvoton/NUC121/Include/bpwm_reg.h
#define BPWM_CAPIEN_CAPRIEN1_Pos          (1)                                              /*!< BPWM_T::CAPIEN: CAPRIEN1 Position      */
#define BPWM_CAPIEN_CAPRIEN1_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN1_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN1 Mask          */

#define BPWM_CAPIEN_CAPRIEN2_Pos          (2)                                              /*!< BPWM_T::CAPIEN: CAPRIEN2 Position      */
#define BPWM_CAPIEN_CAPRIEN2_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN2_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN2 Mask          */

#define BPWM_CAPIEN_CAPRIEN3_Pos          (3)                                              /*!< BPWM_T::CAPIEN: CAPRIEN3 Position      */
#define BPWM_CAPIEN_CAPRIEN3_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN3_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN3 Mask          */

#define BPWM_CAPIEN_CAPRIEN4_Pos          (4)                                              /*!< BPWM_T::CAPIEN: CAPRIEN4 Position      */
#define BPWM_CAPIEN_CAPRIEN4_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN4_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN4 Mask          */

#define BPWM_CAPIEN_CAPRIEN5_Pos          (5)                                              /*!< BPWM_T::CAPIEN: CAPRIEN5 Position      */
#define BPWM_CAPIEN_CAPRIEN5_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN5_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN5 Mask          */

#define BPWM_CAPIEN_CAPFIEN0_Pos          (8)                                              /*!< BPWM_T::CAPIEN: CAPFIEN0 Position      */
#define BPWM_CAPIEN_CAPFIEN0_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN0_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN0 Mask          */

#define BPWM_CAPIEN_CAPFIEN1_Pos          (9)                                              /*!< BPWM_T::CAPIEN: CAPFIEN1 Position      */
#define BPWM_CAPIEN_CAPFIEN1_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN1_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN1 Mask          */

#define BPWM_CAPIEN_CAPFIEN2_Pos          (10)                                             /*!< BPWM_T::CAPIEN: CAPFIEN2 Position      */
#define BPWM_CAPIEN_CAPFIEN2_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN2_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN2 Mask          */

#define BPWM_CAPIEN_CAPFIEN3_Pos          (11)                                             /*!< BPWM_T::CAPIEN: CAPFIEN3 Position      */
#define BPWM_CAPIEN_CAPFIEN3_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN3_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN3 Mask          */

#define BPWM_CAPIEN_CAPFIEN4_Pos          (12)                                             /*!< BPWM_T::CAPIEN: CAPFIEN4 Position      */
#define BPWM_CAPIEN_CAPFIEN4_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN4_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN4 Mask          */

#define BPWM_CAPIEN_CAPFIEN5_Pos          (13)                                             /*!< BPWM_T::CAPIEN: CAPFIEN5 Position      */
#define BPWM_CAPIEN_CAPFIEN5_Msk          (0x1ul << BPWM_CAPIEN_CAPFIEN5_Pos)              /*!< BPWM_T::CAPIEN: CAPFIEN5 Mask          */

#define BPWM_CAPIF_CRLIF0_Pos             (0)                                              /*!< BPWM_T::CAPIF: CRLIF0 Position         */
#define BPWM_CAPIF_CRLIF0_Msk             (0x1ul << BPWM_CAPIF_CRLIF0_Pos)                 /*!< BPWM_T::CAPIF: CRLIF0 Mask             */

#define BPWM_CAPIF_CRLIF1_Pos             (1)                                              /*!< BPWM_T::CAPIF: CRLIF1 Position         */
#define BPWM_CAPIF_CRLIF1_Msk             (0x1ul << BPWM_CAPIF_CRLIF1_Pos)                 /*!< BPWM_T::CAPIF: CRLIF1 Mask             */

#define BPWM_CAPIF_CRLIF2_Pos             (2)                                              /*!< BPWM_T::CAPIF: CRLIF2 Position         */
#define BPWM_CAPIF_CRLIF2_Msk             (0x1ul << BPWM_CAPIF_CRLIF2_Pos)                 /*!< BPWM_T::CAPIF: CRLIF2 Mask             */

#define BPWM_CAPIF_CRLIF3_Pos             (3)                                              /*!< BPWM_T::CAPIF: CRLIF3 Position         */
#define BPWM_CAPIF_CRLIF3_Msk             (0x1ul << BPWM_CAPIF_CRLIF3_Pos)                 /*!< BPWM_T::CAPIF: CRLIF3 Mask             */

#define BPWM_CAPIF_CRLIF4_Pos             (4)                                              /*!< BPWM_T::CAPIF: CRLIF4 Position         */
#define BPWM_CAPIF_CRLIF4_Msk             (0x1ul << BPWM_CAPIF_CRLIF4_Pos)                 /*!< BPWM_T::CAPIF: CRLIF4 Mask             */

#define BPWM_CAPIF_CRLIF5_Pos             (5)                                              /*!< BPWM_T::CAPIF: CRLIF5 Position         */
#define BPWM_CAPIF_CRLIF5_Msk             (0x1ul << BPWM_CAPIF_CRLIF5_Pos)                 /*!< BPWM_T::CAPIF: CRLIF5 Mask             */

#define BPWM_CAPIF_CFLIF0_Pos             (8)                                              /*!< BPWM_T::CAPIF: CFLIF0 Position         */
#define BPWM_CAPIF_CFLIF0_Msk             (0x1ul << BPWM_CAPIF_CFLIF0_Pos)                 /*!< BPWM_T::CAPIF: CFLIF0 Mask             */

#define BPWM_CAPIF_CFLIF1_Pos             (9)                                              /*!< BPWM_T::CAPIF: CFLIF1 Position         */
#define BPWM_CAPIF_CFLIF1_Msk             (0x1ul << BPWM_CAPIF_CFLIF1_Pos)                 /*!< BPWM_T::CAPIF: CFLIF1 Mask             */

#define BPWM_CAPIF_CFLIF2_Pos             (10)                                             /*!< BPWM_T::CAPIF: CFLIF2 Position         */
#define BPWM_CAPIF_CFLIF2_Msk             (0x1ul << BPWM_CAPIF_CFLIF2_Pos)                 /*!< BPWM_T::CAPIF: CFLIF2 Mask             */

#define BPWM_CAPIF_CFLIF3_Pos             (11)                                             /*!< BPWM_T::CAPIF: CFLIF3 Position         */
#define BPWM_CAPIF_CFLIF3_Msk             (0x1ul << BPWM_CAPIF_CFLIF3_Pos)                 /*!< BPWM_T::CAPIF: CFLIF3 Mask             */

#define BPWM_CAPIF_CFLIF4_Pos             (12)                                             /*!< BPWM_T::CAPIF: CFLIF4 Position         */
#define BPWM_CAPIF_CFLIF4_Msk             (0x1ul << BPWM_CAPIF_CFLIF4_Pos)                 /*!< BPWM_T::CAPIF: CFLIF4 Mask             */

#define BPWM_CAPIF_CFLIF5_Pos             (13)                                             /*!< BPWM_T::CAPIF: CFLIF5 Position         */
#define BPWM_CAPIF_CFLIF5_Msk             (0x1ul << BPWM_CAPIF_CFLIF5_Pos)                 /*!< BPWM_T::CAPIF: CFLIF5 Mask             */

#define BPWM_PBUF_PBUF_Pos               (0)                                               /*!< BPWM_T::PBUF: PBUF Position            */
#define BPWM_PBUF_PBUF_Msk               (0xfffful << BPWM_PBUF_PBUF_Pos)                  /*!< BPWM_T::PBUF: PBUF Mask                */

#define BPWM_CMPBUF_CMPBUF_Pos           (0)                                               /*!< BPWM_T::CMPBUF: CMPBUF Position        */
#define BPWM_CMPBUF_CMPBUF_Msk           (0xfffful << BPWM_CMPBUF_CMPBUF_Pos)              /*!< BPWM_T::CMPBUF: CMPBUF Mask            */

/**@}*/ /* BPWM_CONST */
/**@}*/ /* end of BPWM register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __BPWM_REG_H__ */
